       program-id. PROVA2019 as "PROVA2019".

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.
             

           goback.

       end program PROVA2019.
